app/views/gees/show.html.erb

SELECT "fields".* FROM "fields" WHERE "fields"."gee_id" = $1  [["gee_id", 1]]
---
  </thead>
  <% @gee.fields.each do |field| %>

SELECT "alternatives".* FROM "alternatives" WHERE "alternatives"."field_id" = $1  [["field_id", 8]]
---
            <ul>
              <% field.alternatives.each do |alternative| %>