app/controllers/fields_controller.rb

  def index
    @fields = Field.all
---
SELECT "fields".* FROM "fields"