app/controllers/gees_controller.rb

SELECT "gees".* FROM "gees"
---
  def index
    @gees = Gee.all

INSERT INTO "alternatives" ("field_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["field_id", 3], ["value", "buena"], ["created_at", 2017-04-29 20:43:41 UTC], ["updated_at", 2017-04-29 20:43:41 UTC]]
---
          alternative = Alternative.new(
            field: field.id,
            value: alternative_names[j])
          @alternatives.push(alternative)

INSERT INTO "fields" ("gee_id", "name", "ttype", "min_value", "max_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["gee_id", 2], ["name", "jaja"], ["ttype", "number"], ["min_value", 0], ["max_value", 15], ["created_at", 2017-04-29 20:58:41 UTC], ["updated_at", 2017-04-29 20:58:41 UTC]]
---
        raise "Type %{types[i]} does not exist"
      end
      cur_alternative_number += alternative_numbers[i].to_i
      @fields.push(field)

INSERT INTO "gees" ("user_id", "name", "description", "category_id", "expiration_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
            end
            field.save!
          end
          @gee.save!

DELETE FROM "gees" WHERE "gees"."id" = $1  [["id", 2]]
---
  def destroy
    @gee.destroy

SELECT  "gees".* FROM "gees" WHERE "gees"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_gee
      @gee = Gee.find(params[:id])