app/controllers/users_controller.rb

  def show
    friendship = Friendship.where('user_id=:user AND friend_id=:friend OR user_id=:friend AND friend_id=:user',
      user: current_user, friend: @user).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "andres"], ["email", "andresespinosapc@gmail.com"], ["password", "wena"], ["created_at", 2017-04-28 00:43:22 UTC], ["updated_at", 2017-04-28 00:43:22 UTC]]